<template>
  <q-page padding>
    <page-header title="Help"/>
    <div>
      <p>
        Привет!<br/>
        Это приложение создано, чтобы помочь тебе с медитацией. Идея в том, чтобы повысить мотивацию, дав тебе возможность объективней оценивать качество твоей практики и добавив к ней игровой и соревновательный элементы.
      </p>
      <p>
        Медитация – это вызов. В первую очередь самому себе, своему вниманию. Когда ты нажмёшь на Большую Красную Кнопку у тебя будет 15 минут для медитации, во время которых ты услышишь (если не заснёшь) 5 звоночков, включая завершающий сессию. Твоя задача – отмечать, чем занят твой ум во время сигнала: сконцентрирован на объекте медитации или отвлечён на мысли. Если сконцентрирован, можешь мысленно прибавить себе один балл. В конце сессии у тебя получится от 0 до 5 баллов и приложение сохранит твой результат.
      </p>
      <p>
        На основании оценок твоих сессий приложение будет строить два графика.<br/>
        Маленький снизу – твоя средняя ежедневная оценка за последние 30 дней. Если ты станешь лучше медитировать – ты заметишь на этом графике.<br/>
        Большой сверху – общая сумма баллов за все сессии. Сюда можно добавить других пользователей приложения и следить/соревноваться с ними. Кстати, за каждую сессию тебе прибавляется 1 балл, просто так, потому что ты молодец.<br/>
      </p>
      <p>
        И еще кое-что:
        <ul>
          <li class="help-li">Первый звонок во время старта сессии не считается, но он поможет тебе отрегулировать громкость.</li>
          <li class="help-li">Последний звонок отличается звуком, так что не волнуйся, ты не пропустишь окончание сессии (если не уснёшь, конечно).</li>
          <li class="help-li">Сигналы расставлены во времени случайным образом (кроме последнего), так что будет интересно.</li>
        </ul>
      </p>
    </div>
  </q-page>
</template>

<script>
import PageHeader from 'components/PageHeader'
export default {
  // name: 'PageName',
  components: {
    PageHeader
  }
}
</script>
